nsynet/electronics_project/0_论文_项目/0100、ENC28j60网络模块设计资料及其程序/sch_code_stm32f103_ENC28J60_keil/schematic_code_stm32f103/Software2.0/软件2.0/ili9320.c
        ili9320_WriteRegister(0x0001,0x0100); 
        ili9320_WriteRegister(0x0002,0x0700); 
        ili9320_WriteRegister(0x0003,0x1030); 
        ili9320_WriteRegister(0x0004,0x0000); 
        ili9320_WriteRegister(0x000C,0x0000); 
        ili9320_WriteRegister(0x000F,0x0000); 
        ili9320_WriteRegister(0x0020,0x0000); 
        ili9320_WriteRegister(0x0021,0x0000); 
        ili9320_WriteRegister(0x0007,0x0021); 
        ili9320_Delay(20);
        ili9320_WriteRegister(0x0007,0x0061); 
        ili9320_Delay(20);
        ili9320_WriteRegister(0x0007,0x0173); 
        ili9320_Delay(20);
	}							 			  
	else if(DeviceCode==0x8989)
	{
		ili9320_WriteRegister(0x0000,0x0001);    ili9320_Delay(50000);  //打开晶振
    	ili9320_WriteRegister(0x0003,0xA8A4);    ili9320_Delay(50000);   //0xA8A4
    	ili9320_WriteRegister(0x000C,0x0000);    ili9320_Delay(50000);   
    	ili9320_WriteRegister(0x000D,0x080C);    ili9320_Delay(50000);   
    	ili9320_WriteRegister(0x000E,0x2B00);    ili9320_Delay(50000);   
    	ili9320_WriteRegister(0x001E,0x00B0);    ili9320_Delay(50000);   
    	ili9320_WriteRegister(0x0001,0x2B3F);    ili9320_Delay(50000);   //驱动输出控制320*240  0x6B3F
    	ili9320_WriteRegister(0x0002,0x0600);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0010,0x0000);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0011,0x6070);    ili9320_Delay(50000);        //0x4030           //定义数据格式  16位色 		横屏 0x6058
    	ili9320_WriteRegister(0x0005,0x0000);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0006,0x0000);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0016,0xEF1C);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0017,0x0003);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0007,0x0233);    ili9320_Delay(50000);        //0x0233       
    	ili9320_WriteRegister(0x000B,0x0000);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x000F,0x0000);    ili9320_Delay(50000);        //扫描开始地址
    	ili9320_WriteRegister(0x0041,0x0000);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0042,0x0000);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0048,0x0000);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0049,0x013F);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x004A,0x0000);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x004B,0x0000);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0044,0xEF00);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0045,0x0000);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0046,0x013F);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0030,0x0707);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0031,0x0204);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0032,0x0204);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0033,0x0502);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0034,0x0507);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0035,0x0204);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0036,0x0204);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0037,0x0502);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x003A,0x0302);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x003B,0x0302);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0023,0x0000);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0024,0x0000);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x0025,0x8000);    ili9320_Delay(50000);
    	ili9320_WriteRegister(0x004f,0);        //行首址0
    	ili9320_WriteRegister(0x004e,0);        //列首址0
	}  */
  for(i=50000;i>0;i--);
  ili9320_Clear(0x0000);
}

/****************************************************************************
* 名    称：void ili9320_SetCursor(u16 x,u16 y)
* 功    能：设置屏幕座标
* 入口参数：x      行座标
*           y      列座标
* 出口参数：无
* 说    明：
* 调用方法：ili9320_SetCursor(10,10);
****************************************************************************/
__inline void ili9320_SetCursor(u16 x,u16 y)
{
	if(DeviceCode==0x8989)
	{
	 	ili9320_WriteRegister(0x004e,y);        //行
    	ili9320_WriteRegister(0x004f,0x13f-x);  //列
	}
	else if(DeviceCode==0x9919)
	{
		ili9320_WriteRegister(0x004e,x); // 行
  		ili9320_WriteRegister(0x004f,y); // 列	
	}
	else
	{
  		ili9320_WriteRegister(0x0020,x); // 行
  		ili9320_WriteRegister(0x0021,y); // 列
	}
}

/****************************************************************************
* 名    称：void ili9320_SetWindows(u16 StartX,u16 StartY,u16 EndX,u16 EndY)
* 功    能：设置窗口区域
* 入口参数：StartX     行起始座标
*           StartY     列起始座标
*           EndX       行结束座标
*           EndY       列结束座标
* 出口参数：无
* 说    明：
* 调用方法：ili9320_SetWindows(0,0,100,100)；
****************************************************************************/
__inline void ili9320_SetWindows(u16 StartX,u16 StartY,u16 EndX,u16 EndY)
{
  ili9320_SetCursor(StartX,StartY);
  ili9320_WriteRegister(0x0050, StartX);
  ili9320_WriteRegister(0x0051, EndX);
  ili9320_WriteRegister(0x0052, StartY);
  ili9320_WriteRegister(0x0053, EndY);
}

/****************************************************************************
* 名    称：void ili9320_Clear(u16 dat)
* 功    能：将屏幕填充成指定的颜色，如清屏，则填充 0xffff
* 入口参数：dat      填充值
* 出口参数：无
* 说    明：
* 调用方法：ili9320_Clear(0xffff);
****************************************************************************/
void ili9320_Clear(u16 dat)
{
  u32  i;

  ili9320_SetCursor(0x0000, 0x0000);  
  Clr_Cs; 
  ili9320_WriteIndex(0x0022); 
  Set_Rs;   
  for(i=0;i<76800;i++)
  {
    ili9320_WriteData(dat);
	Clr_nWr;
	Set_nWr;
  }

  Set_Cs;
}

/****************************************************************************
* 名    称：u16 ili9320_GetPoint(u16 x,u16 y)
* 功    能：获取指定座标的颜色值
* 入口参数：x      行座标
*           y      列座标
* 出口参数：当前座标颜色值
* 说    明：
* 调用方法：i=ili9320_GetPoint(10,10);
****************************************************************************/
//u16 ili9320_GetPoint(u16 x,u16 y)
//{
//  ili9320_SetCursor(x,y);
//  return (ili9320_BGR2RGB(ili9320_ReadRegister(0x0022)));
//}

