nsynet/electronics_project/0_论文_项目/0100、ENC28j60网络模块设计资料及其程序/sch_code_stm32f103_ENC28J60_keil/schematic_code_stm32f103/Software2.0/软件2.0/ili9320.c
u16 ili9320_GetPoint(u16 x,u16 y)
{
  u16 temp;
  ili9320_SetCursor(x,y);
  Clr_Cs;
  ili9320_WriteIndex(0x0022);
   Clr_nRd;  
	temp = ili9320_ReadData(); //dummy
   Set_nRd;   
   Clr_nRd;  
	temp = ili9320_ReadData(); 
   Set_nRd;	
   Set_Cs;
   temp=ili9320_BGR2RGB(temp);

   return (temp);
}


/****************************************************************************
* 名    称：void ili9320_SetPoint(u16 x,u16 y,u16 point)
* 功    能：在指定座标画点
* 入口参数：x      行座标
*           y      列座标
*           point  点的颜色
* 出口参数：无
* 说    明：
* 调用方法：ili9320_SetPoint(10,10,0x0fe0);
****************************************************************************/
void ili9320_SetPoint(u16 x,u16 y,u16 point)
{
  if ( (y>320)||(x>240) ) return;
  ili9320_SetCursor(x,y);

  Clr_Cs;
  ili9320_WriteIndex(0x0022);
  Set_Rs;
  ili9320_WriteData(point);
  Clr_nWr;Set_nWr;
  Set_Cs;
}

/****************************************************************************
* 名    称：void ili9320_DrawPicture(u16 StartX,u16 StartY,u16 EndX,u16 EndY,u16 *pic)
* 功    能：在指定座标范围显示一副图片
* 入口参数：StartX     行起始座标
*           StartY     列起始座标
*           EndX       行结束座标
*           EndY       列结束座标
            pic        图片头指针
* 出口参数：无
* 说    明：图片取模格式为水平扫描，16位颜色模式
* 调用方法：ili9320_DrawPicture(0,0,100,100,(u16*)demo);
****************************************************************************/
void ili9320_DrawPicture(u16 StartX,u16 StartY,u16 EndX,u16 EndY,u16 *pic)
{
    u16  i;
    ili9320_SetWindows(StartX,StartY,EndX,EndY);
    ili9320_SetCursor(StartX,StartY);
    
    Clr_Cs;
    
    ili9320_WriteIndex(0x0022);
    Set_Rs;
    for (i=0;i<((EndX - StartX + 1 )*(EndY - StartY + 1));i++)
    {
      ili9320_WriteData(*pic++);
      Clr_nWr;Set_nWr;
    }
      
    Set_Cs;
    
	ili9320_WriteRegister(0x0050, 0x0000); // Horizontal GRAM Start Address
	ili9320_WriteRegister(0x0051, 0x00EF); // Horizontal GRAM End Address
	ili9320_WriteRegister(0x0052, 0x0000); // Vertical GRAM Start Address
	ili9320_WriteRegister(0x0053, 0x013F); // Vertical GRAM Start Address  
}

void ili9320_FillRect(u16 StartX,u16 StartY,u16 EndX,u16 EndY,u16 clr)
{
    u16  i;
    ili9320_SetWindows(StartX,StartY,EndX,EndY);
    ili9320_SetCursor(StartX,StartY);
    
    Clr_Cs;
    
    ili9320_WriteIndex(0x0022);
    Set_Rs;
    for (i=0;i<((EndX - StartX + 1 )*(EndY - StartY + 1));i++)
    {
      ili9320_WriteData(clr);
      Clr_nWr;Set_nWr;
    }
      
    Set_Cs;
    
	ili9320_WriteRegister(0x0050, 0x0000); // Horizontal GRAM Start Address
	ili9320_WriteRegister(0x0051, 0x00EF); // Horizontal GRAM End Address
	ili9320_WriteRegister(0x0052, 0x0000); // Vertical GRAM Start Address
	ili9320_WriteRegister(0x0053, 0x013F); // Vertical GRAM Start Address        
}
/****************************************************************************
* 名    称：void ili9320_putc(u8 c)
* 功    能：显示一个8x16点阵的ascii字符
* 入口参数：c 要显示的ascii字符
* 出口参数：无
* 说    明：显示范围限定为可显示的ascii码
* 调用方法：ili9320_putc('a');
****************************************************************************/

void ili9320_moveto(u16 x, u16 y)
{
    curx = x *8;
    cury = y * 16;
}

void ili9320_clrline(u16 y)
{
    ili9320_FillRect(0,y * 16,239,y * 16 + 16, BackColor);     
}


void ili9320_putc(u8 c)
{
    static u16 scrollline = 0;
    static u8 lastch = 0;
    if(curx == 0 && scrollline)
    {
        ili9320_WriteRegister(0x006A,scrollline);//垂直GRAM起始位置
        //清空最后一行
        ili9320_FillRect(0,scrollline - 16,239,scrollline, BackColor);   
        scrollline += 16;         
    }
#ifdef __USE_CH_FONT__
    if(c & 0x80)
        lastch ++;

    if(lastch & 0x01)
    {
        if(curx == 232) //如果是双字节汉字,并只剩下一个字符，则换行
        {
            curx = 0;
            cury += 16;            
            
            if(cury >= 320)
            {
                cury = 0;
                scrollline = 16;
            
                ili9320_WriteRegister(0x006A,scrollline);//垂直GRAM起始位置
                //清空最后一行
                ili9320_FillRect(0,scrollline - 16,239,scrollline, BackColor);   
                scrollline += 16; 
            }
            else
            {
                if(scrollline)
                {
                    ili9320_WriteRegister(0x006A,scrollline);//垂直GRAM起始位置
                    //清空最后一行
                    ili9320_FillRect(0,scrollline - 16,239,scrollline, BackColor);   
                    scrollline += 16;       
                }
            }
        }     
    }
#endif
    if(c == '\n')
    {
        curx = 0;
        cury += 16;
    }
    else
    {
        #ifdef __USE_CH_FONT__
        ili9320_PutChar_cf(curx,cury ,c,FrontColor,BackColor);
        #else
        ili9320_PutChar_f(curx,cury ,c,FrontColor,BackColor);
        #endif
        curx += 8;
    }
    if(curx >= 240)
    {
        curx = 0;
        cury += 16;    
    } 
    if(cury >= 320)
    {
        cury = 0;
        scrollline = 16;
    }
}

/****************************************************************************
* 名    称：void ili9320_PutChar(u16 x,u16 y,u8 c,u16 charColor,u16 bkColor)
* 功    能：在指定座标显示一个8x16点阵的ascii字符
* 入口参数：x          行座标
*           y          列座标
*           charColor  字符的颜色
*           bkColor    字符背景颜色
* 出口参数：无
* 说    明：显示范围限定为可显示的ascii码
* 调用方法：ili9320_PutChar(10,10,'a',0x0000,0xffff);
****************************************************************************/
void ili9320_PutChar(u16 x,u16 y,u8 c,u16 charColor,u16 bkColor)
{
  u16 i=0;
  u16 j=0;
  
  u8 tmp_char=0;
  
  for (i=0;i<16;i++)
  {
    tmp_char=ascii_8x16[((c-0x20)*16)+i];
    for (j=0;j<8;j++)
    {
      if ( (tmp_char >> 7-j) & 0x01 == 0x01)
        {
          ili9320_SetPoint(x+j,y+i,charColor); // 字符颜色
          //  ili9320_SetPoint(x+i,y+j,charColor); // 字符颜色
        }
        else
        {
          ili9320_SetPoint(x+j,y+i,bkColor); // 背景颜色
          //  ili9320_SetPoint(x+i,y+j,bkColor); // 背景颜色
        }
    }
  }
}

void ili9320_PutChar_f(u16 x,u16 y,u8 c,u16 charColor,u16 bkColor)
{
    u16 i=0;
    u16 j=0;
    
    u8 tmp_char=0;

    ili9320_SetWindows(x,y,x + 7,y + 15);
    ili9320_SetCursor(x,y);
    
