nsynet/electronics_project/0_论文_项目/0100、ENC28j60网络模块设计资料及其程序/sch_code_stm32f103_ENC28J60_keil/schematic_code_stm32f103/Software2.0/软件2.0/ili9320.c
    Clr_Cs;
    
    ili9320_WriteIndex(0x0022);
    Set_Rs;
    for (i=0;i<16;i++)
    {
        tmp_char=ascii_8x16[((c-0x20)*16)+i];
        for (j=0;j<8;j++)
        {
            if ( (tmp_char >> 7-j) & 0x01 == 0x01)
            {
                ili9320_WriteData(charColor);                   
            }
            else
            {
                ili9320_WriteData(bkColor);   
            }
            Clr_nWr;Set_nWr;
        }
    }
   
    Set_Cs;
    
    //ili9320_WriteRegister(0x0050, 0x0000); // Horizontal GRAM Start Address
    //ili9320_WriteRegister(0x0051, 0x00EF); // Horizontal GRAM End Address
    //ili9320_WriteRegister(0x0052, 0x0000); // Vertical GRAM Start Address
    //ili9320_WriteRegister(0x0053, 0x013F); // Vertical GRAM Start Address  
}
#ifdef __USE_CH_FONT__
void ili9320_PutChar_cf(u16 x,u16 y,u8 c,u16 charColor,u16 bkColor)
{
    u16 i=0;
    u16 j=0;
    static u8 lastch;
    u8 tmp_char=0;
    u8 widecharflag = 0;
    extern u8 Font_ch16x16[];
    if(c & 0x80)
    {
        if(lastch == 0)
        {
            lastch = c;
            return;
        }
        else
        {
            widecharflag = 8;
        }
    }
    else
    {
        widecharflag = 0;
        lastch = 0;
    }   

    ili9320_SetWindows(x - widecharflag,y,x + 7 ,y + 15);
    ili9320_SetCursor(x - widecharflag,y);
    
    Clr_Cs;
    
    ili9320_WriteIndex(0x0022);
    Set_Rs;
    if(widecharflag == 0)
    {
        for (i=0;i<16;i++)
        {
            tmp_char=ascii_8x16[((c-0x20)*16)+i];
            for (j=0;j<8;j++)
            {
                if ( (tmp_char >> 7-j) & 0x01)
                {
                    ili9320_WriteData(charColor);                   
                }
                else
                {
                    ili9320_WriteData(bkColor);   
                }
                Clr_nWr;Set_nWr;
            }
        }
    }
    else
    {           
        u16 *chdata;
        x = (lastch - 161) * 94 + c - 161;
        chdata = (u16 *)&Font_ch16x16[x * 32];
        for (i=0;i<16;i++)
        {
            for (j=0;j<16;j++)
            {
                if (((*chdata) >> j) & 0x01)
                {
                    ili9320_WriteData(charColor);                   
                }
                else
                {
                    ili9320_WriteData(bkColor);   
                }
                Clr_nWr;Set_nWr;
            }
            chdata++;
        }
        lastch = 0;
    }
    Set_Cs;
    
    //ili9320_WriteRegister(0x0050, 0x0000); // Horizontal GRAM Start Address
    //ili9320_WriteRegister(0x0051, 0x00EF); // Horizontal GRAM End Address
    //ili9320_WriteRegister(0x0052, 0x0000); // Vertical GRAM Start Address
    //ili9320_WriteRegister(0x0053, 0x013F); // Vertical GRAM Start Address  
}
#endif
/****************************************************************************
* 名    称：void ili9320_Test()
* 功    能：测试液晶屏
* 入口参数：无
* 出口参数：无
* 说    明：显示彩条，测试液晶屏是否正常工作
* 调用方法：ili9320_Test();
****************************************************************************/
void ili9320_Test()
{
  u8  R_data,G_data,B_data,i,j;

	ili9320_SetCursor(0x00, 0x0000);
	ili9320_WriteRegister(0x0050,0x00);//水平 GRAM起始位置
	ili9320_WriteRegister(0x0051,239);//水平GRAM终止位置
	ili9320_WriteRegister(0x0052,0);//垂直GRAM起始位置
	ili9320_WriteRegister(0x0053,319);//垂直GRAM终止位置  
	Clr_Cs; 
	ili9320_WriteIndex(0x0022);
	Set_Rs;
    R_data=0;G_data=0;B_data=0;     
    for(j=0;j<50;j++)//红色渐强条
    {
        for(i=0;i<240;i++)
            {R_data=i/8;ili9320_WriteData(R_data<<11|G_data<<5|B_data);
			Clr_nWr;Set_nWr;}
    }
    R_data=0x1f;G_data=0x3f;B_data=0x1f;
    for(j=0;j<50;j++)
    {
        for(i=0;i<240;i++)
            {
            G_data=0x3f-(i/4);
            B_data=0x1f-(i/8);
            ili9320_WriteData(R_data<<11|G_data<<5|B_data);
			Clr_nWr;
			Set_nWr;
			}
    }
//----------------------------------
    R_data=0;G_data=0;B_data=0;
    for(j=0;j<50;j++)//绿色渐强条
    {
        for(i=0;i<240;i++)
            {G_data=i/4;
			ili9320_WriteData(R_data<<11|G_data<<5|B_data);
			Clr_nWr;
			Set_nWr;}
    }

    R_data=0x1f;G_data=0x3f;B_data=0x1f;
    for(j=0;j<50;j++)
    {
        for(i=0;i<240;i++)
            {
            R_data=0x1f-(i/8);
            B_data=0x1f-(i/8);
            ili9320_WriteData(R_data<<11|G_data<<5|B_data);
			Clr_nWr;
			Set_nWr;
		}
    }
//----------------------------------
 
    R_data=0;G_data=0;B_data=0;
    for(j=0;j<60;j++)//蓝色渐强条
    {
        for(i=0;i<240;i++)
            {B_data=i/8;ili9320_WriteData(R_data<<11|G_data<<5|B_data);
			Clr_nWr;
			Set_nWr;}
    } 

    B_data=0; 
    R_data=0x1f;G_data=0x3f;B_data=0x1f;

    for(j=0;j<60;j++)
    {
        for(i=0;i<240;i++)
            {
            G_data=0x3f-(i/4);
            R_data=0x1f-(i/8);
            ili9320_WriteData(R_data<<11|G_data<<5|B_data);
			Clr_nWr;
			Set_nWr;
		}
    }	  
	Set_Cs;
}

/****************************************************************************
* 名    称：u16 ili9320_BGR2RGB(u16 c)
* 功    能：RRRRRGGGGGGBBBBB 改为 BBBBBGGGGGGRRRRR 格式
* 入口参数：c      BRG 颜色值
* 出口参数：RGB 颜色值
* 说    明：内部函数调用
* 调用方法：
****************************************************************************/
u16 ili9320_BGR2RGB(u16 c)
{
  u16  r, g, b, rgb;

  b = (c>>0)  & 0x1f;
  g = (c>>5)  & 0x3f;
  r = (c>>11) & 0x1f;
  
  rgb =  (b<<11) + (g<<5) + (r<<0);

  return( rgb );
}


/****************************************************************************
* 名    称：void ili9320_WriteIndex(u16 idx)
* 功    能：写 ili9320 控制器寄存器地址
* 入口参数：idx   寄存器地址
* 出口参数：无
* 说    明：调用前需先选中控制器，内部函数
* 调用方法：ili9320_WriteIndex(0x0000);
****************************************************************************/
__inline void ili9320_WriteIndex(u16 idx)
{
    Clr_Rs;
	Set_nRd;
	ili9320_WriteData(idx);
	Clr_nWr;
	Set_nWr;
	Set_Rs;
}

/****************************************************************************
* 名    称：void ili9320_WriteData(u16 dat)
* 功    能：写 ili9320 寄存器数据
* 入口参数：dat     寄存器数据
* 出口参数：无
* 说    明：向控制器指定地址写入数据，调用前需先写寄存器地址，内部函数
* 调用方法：ili9320_WriteData(0x1030)
****************************************************************************/
//void ili9320_WriteData(u16 data)
//{
    //GPIOB->ODR=((GPIOB->ODR&0x00ff)|(data<<8));
	//GPIOC->ODR=((GPIOC->ODR&0xff00)|(data>>8));
//    GPIOC->ODR = data;
//}

/****************************************************************************
* 名    称：u16 ili9320_ReadData(void)
* 功    能：读取控制器数据
* 入口参数：无
* 出口参数：返回读取到的数据
* 说    明：内部函数
* 调用方法：i=ili9320_ReadData();
****************************************************************************/
__inline u16 ili9320_ReadData(void)
{
//========================================================================
// **                                                                    **
// ** nCS       ----\__________________________________________/-------  **
// ** RS        ------\____________/-----------------------------------  **
// ** nRD       -------------------------\_____/---------------------  **
// ** nWR       --------\_______/--------------------------------------  **
// ** DB[0:15]  ---------[index]----------[data]-----------------------  **
// **                                                                    **
//========================================================================
	u16 tmp;
//	GPIOB->CRH = (GPIOB->CRH & 0x00000000) | 0x44444444;
//	GPIOC->CRL = (GPIOC->CRL & 0x00000000) | 0x44444444;
//  tmp = (((GPIOB->IDR)>>8)|((GPIOC->IDR)<<8));
//	GPIOB->CRH = (GPIOB->CRH & 0x00000000) | 0x33333333;
//	GPIOC->CRL = (GPIOC->CRL & 0x00000000) | 0x33333333;
    GPIOC->CRH = (GPIOC->CRH & 0x00000000) | 0x44444444;
	GPIOC->CRL = (GPIOC->CRL & 0x00000000) | 0x44444444;
    tmp = 10;
    while(tmp--);
    tmp = GPIOC->IDR;
    GPIOC->CRH = (GPIOC->CRH & 0x00000000) | 0x33333333;
    GPIOC->CRL = (GPIOC->CRL & 0x00000000) | 0x33333333;
	return tmp;
}

/****************************************************************************
* 名    称：u16 ili9320_ReadRegister(u16 index)
* 功    能：读取指定地址寄存器的值
* 入口参数：index    寄存器地址
* 出口参数：寄存器值
* 说    明：内部函数
* 调用方法：i=ili9320_ReadRegister(0x0022);
****************************************************************************/
__inline u16 ili9320_ReadRegister(u16 index)
{ 
  	Clr_Cs;
	ili9320_WriteIndex(index);
	Clr_nRd;     
	index = ili9320_ReadData(); 
	Set_nRd;      	
	Set_Cs;
	return index;
}

/****************************************************************************
* 名    称：void ili9320_WriteRegister(u16 index,u16 dat)
* 功    能：写指定地址寄存器的值
* 入口参数：index    寄存器地址
*         ：dat      寄存器值
* 出口参数：无
* 说    明：内部函数
* 调用方法：ili9320_WriteRegister(0x0000,0x0001);
****************************************************************************/
__inline void ili9320_WriteRegister(u16 index,u16 dat)
{
 /************************************************************************
  **                                                                    **
  ** nCS       ----\__________________________________________/-------  **
  ** RS        ------\____________/-----------------------------------  **
  ** nRD       -------------------------------------------------------  **
  ** nWR       --------\_______/--------\_____/-----------------------  **
  ** DB[0:15]  ---------[index]----------[data]-----------------------  **
  **                                                                    **
  ************************************************************************/
//   u16 temp;
    Clr_Cs;
	Clr_Rs;
	Set_nRd;
	ili9320_WriteData(index);
//	temp=(*((volatile unsigned long *) 0x40010C0C));
//	(*((volatile unsigned long *) 0x40010C0C))=(index<<8)|(temp&0x00ff);
//	temp=(*((volatile unsigned long *) 0x4001100C));
//	(*((volatile unsigned long *) 0x4001100C))=(index>>8)|(temp&0xff00);
	Clr_nWr;
	Set_nWr;
	Set_Rs;       
	ili9320_WriteData(dat);  
//	temp=(*((volatile unsigned long *) 0x40010C0C));
//	(*((volatile unsigned long *) 0x40010C0C))=(dat<<8)|(temp&0x00ff);
//	temp=(*((volatile unsigned long *) 0x4001100C));
//	(*((volatile unsigned long *) 0x4001100C))=(dat>>8)|(temp&0xff00);     
	Clr_nWr;
	Set_nWr;
	Set_Cs;
}

/****************************************************************************
* 名    称：void ili9320_Reset()
* 功    能：复位 ili9320 控制器
* 入口参数：无
* 出口参数：无
* 说    明：复位控制器，内部函数
* 调用方法：ili9320_Reset()
****************************************************************************/
void ili9320_Reset()
{
  /***************************************
   **                                   **
   **  -------\______________/-------   **
   **         | <---Tres---> |          **
   **                                   **
   **  Tres: Min.1ms                    **
   ***************************************/
    
  	Set_Rst;;
    ili9320_Delay(50000);
  	Clr_Rst;
    ili9320_Delay(50000);
  	Set_Rst;
    ili9320_Delay(50000);
}

/****************************************************************************
* 名    称：void ili9320_BackLight(u8 status)
* 功    能：开、关液晶背光
* 入口参数：status     1:背光开  0:背光关
* 出口参数：无
* 说    明：
* 调用方法：ili9320_BackLight(1);
****************************************************************************/
void ili9320_BackLight(u8 status)
{
  if ( status >= 1 )
  {
    Lcd_Light_ON;
  }
  else
  {
    Lcd_Light_OFF;
  }
}

/****************************************************************************
* 名    称：void ili9320_Delay(vu32 nCount)
* 功    能：延时
* 入口参数：nCount   延时值
* 出口参数：无
* 说    明：
* 调用方法：ili9320_Delay(10000);
****************************************************************************/
void ili9320_Delay(vu32 nCount)
{
  for(; nCount != 0; nCount--);
}


